AndrewJNg/ECE4191-G3/Robot_code_G3.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "CyScBoostClk.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "LED_aliases.h"
#include "LED.h"
#include "PWM_1.h"
#include "Clock_1.h"
#include "UART_1.h"
#include "colour_S0_aliases.h"
#include "colour_S0.h"
#include "colour_S1_aliases.h"
#include "colour_S1.h"
#include "colour_S2_aliases.h"
#include "colour_S2.h"
#include "colour_S3_aliases.h"
#include "colour_S3.h"
#include "button_aliases.h"
#include "button.h"
#include "isr_1.h"
#include "colour_out_aliases.h"
#include "colour_out.h"
#include "timer_clock.h"
#include "Timer_1.h"
#include "Control_Reg_1.h"
#include "UART_1_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

